<a href="https://colab.research.google.com/github/ragcode7/DS-SEM5/blob/main/assignment2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Assignment Lab - 28th July

Given instructions:
1.Create a dataframe with rollno name and city

2.Create a dataframe with rollno hobby

3.a.merge both dataframes try with inner 

3.b.merge both dataframes try with outer 

3.c.merge both dataframes try with right 

3.d.merge both dataframes try with  left

4.concat with join parameter inner and outer

5.melt command on first df

6.retrieve the actual dataframe from melt table

7.join both dataframes and explore different options.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#1
d1 = pd.DataFrame({'Rollno': [1,2,3],
                   'Name': ['Ragavi Rajkumar', 'Roshini Rajkumar','Rajkumar'],
                   'city':['Bangalore','Boston','Detroit']})
d1

   Rollno              Name       city
0       1   Ragavi Rajkumar  Bangalore
1       2  Roshini Rajkumar     Boston
2       3          Rajkumar    Detroit

In [ ]:
#2
d2=pd.DataFrame({'Rollno':[1,2,3],
                 'Hobby':['Digital Art','Playing the piano','Photography']})
d2

   Rollno              Hobby
0       1        Digital Art
1       2  Playing the piano
2       3        Photography

In [ ]:
#3a
df_outer = pd.merge(d1, d2, on='Rollno', how='outer')
df_outer

   Rollno              Name       city              Hobby
0       1   Ragavi Rajkumar  Bangalore        Digital Art
1       2  Roshini Rajkumar     Boston  Playing the piano
2       3          Rajkumar    Detroit        Photography

In [ ]:
#3b
df_inner = pd.merge(d1, d2, on='Rollno', how='inner')
df_inner

   Rollno              Name       city              Hobby
0       1   Ragavi Rajkumar  Bangalore        Digital Art
1       2  Roshini Rajkumar     Boston  Playing the piano
2       3          Rajkumar    Detroit        Photography

In [ ]:
#3c
df_left = pd.merge(d1, d2, on='Rollno', how='left')
df_left

   Rollno              Name       city              Hobby
0       1   Ragavi Rajkumar  Bangalore        Digital Art
1       2  Roshini Rajkumar     Boston  Playing the piano
2       3          Rajkumar    Detroit        Photography

In [ ]:
#3d
df_right = pd.merge(d1, d2, on='Rollno', how='right')
df_right

   Rollno              Name       city              Hobby
0       1   Ragavi Rajkumar  Bangalore        Digital Art
1       2  Roshini Rajkumar     Boston  Playing the piano
2       3          Rajkumar    Detroit        Photography

In [ ]:
#4a
df_concat_inner=pd.concat([d1,d2],join='inner',axis=1)
df_concat_inner

   Rollno              Name       city  Rollno              Hobby
0       1   Ragavi Rajkumar  Bangalore       1        Digital Art
1       2  Roshini Rajkumar     Boston       2  Playing the piano
2       3          Rajkumar    Detroit       3        Photography

In [ ]:
#4b
df_concat_outer=pd.concat([d1,d2],join='outer',axis=1)
df_concat_outer

   Rollno              Name       city  Rollno              Hobby
0       1   Ragavi Rajkumar  Bangalore       1        Digital Art
1       2  Roshini Rajkumar     Boston       2  Playing the piano
2       3          Rajkumar    Detroit       3        Photography

In [ ]:
#5
df3=pd.melt(d1.reset_index(), id_vars =['Rollno'], 
            value_vars =['city'])
df3

   Rollno variable      value
0       1     city  Bangalore
1       2     city     Boston
2       3     city    Detroit

In [ ]:
#6
df4=df3.pivot(index='Rollno',columns = 'variable', values = 'value')
df4

variable       city
Rollno
1         Bangalore
2            Boston
3           Detroit

In [ ]:
#7
d1.set_index('Rollno').join(d2.set_index('Rollno'))

                    Name       city              Hobby
Rollno
1        Ragavi Rajkumar  Bangalore        Digital Art
2       Roshini Rajkumar     Boston  Playing the piano
3               Rajkumar    Detroit        Photography